#+TITLE: Emacs Config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+STARTUP: overview

** Basic setup
#+begin_src emacs-lisp
  (setq org-directory "~/org")
  (setq org-log-into-drawer t)
  (setq org-export-backends
        '(md html odt latex))

  ;; Shortcut to org dir files
  (defun my/my-org-finder ()
    (interactive)
    (ido-find-file-in-dir org-directory))

  ;; ignore journal files in recent files
  ;; (setq recentf-exclude '("/org/journal"))

  ;; Sets the column width to 80 columns and enables line breaking, ie. auto-fill.
  (add-hook 'org-mode-hook '(lambda () (setq fill-column 80)))
  (add-hook 'org-mode-hook 'auto-fill-mode)

  (defun my/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil)
    (setq org-list-indent-offset 2))

  (use-package org
    :hook (org-mode . my/org-mode-setup)
    :config
    (dolist (face '((org-document-title . 1.4)
    		  (org-level-1 . 1.3)
    		  (org-level-2 . 1.2)
    		  (org-level-3 . 1.1)
    		  (org-level-4 . 1.1)
    		  (org-level-5 . 1.2)
    		  (org-level-6 . 1.2)
    		  (org-level-7 . 1.2)
    		  (org-level-8 . 1.2)))
      (set-face-attribute (car face) nil
  			 :font "Roboto Slab"
  			 :weight 'normal
  			 :height (cdr face)
  			 ))

    ;; replace ellipsis for closed entries
    (set-display-table-slot standard-display-table
    			'selective-display (string-to-vector "..."))

    (setq org-ellipsis " ▾"
    	org-hide-emphasis-markers t ;; hides the special markup symbols arond text
    	org-startup-indented t
    	org-startup-folded 'overview ;; will fold most items
    	org-src-fontify-natively t
            org-edit-src-content-indentation 2
    	org-fontify-quote-and-verse-blocks t
    	org-fontify-whole-heading-line t))

  ;; helps with org-mode tables that get messed up sometimes
  (use-package mixed-pitch
    :hook
    ;; If you want it in all text modes:
    (text-mode . mixed-pitch-mode))
#+end_src

#+RESULTS:
| mixed-pitch-mode | text-mode-hook-identify |

